### MYSQL
8/6/2022

In [1]:
import mysql.connector as connection

try:
    mydb = connection.connect(host="localhost",user="root",passwd="R@ud!n$0903",use_pure=True)

    query = "SHOW DATABASES"

    cursor = mydb.cursor()
    cursor.execute(query)
    print(cursor.fetchall())

except Exception as e:
    mydb.close()
    print(str(e))

[('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

In [2]:
conn = connection.connect(host="localhost",user="root",passwd="R@ud!n$0903",use_pure=True)

In [3]:
conn.cursor()

In [4]:
cur = conn.cursor()

In [5]:
type(cur.execute("Show Databases"))

NoneType

In [6]:
res = cur.fetchall()
res

[('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

In [7]:
for i in res:
    print(i[0])

information_schema
mysql
performance_schema
sys

In [8]:
import mysql.connector as connection 

try:
    mydb = connection.connect(host="localhost",user="root",passwd="R@ud!n$0903",use_pure=True)
    print(mydb.is_connected())
    query = "Drop Database IF EXISTS Student"
    query1 = "Create Database Student;"
    cursor = mydb.cursor()
    cursor.execute(query)
    cursor.execute(query1)
    print("Database Created!!")
    mydb.close()
except Exception as e:
    mydb.close()
    print(str(e))

True
Database Created!!

In [9]:
mydb = connection.connect(host="localhost",database = "Student" ,user="root",passwd="R@ud!n$0903",use_pure=True)
print(mydb.is_connected())
print(mydb.connection_id)

True
17

In [10]:
cur = mydb.cursor()
cur.execute("Create Table test(x1 INT(5),x2 VARCHAR(20), x3 DATE)")

In [11]:
cur = mydb.cursor()
cur.execute("Insert into test VALUES(5,'HI','2022-06-08')")

In [12]:
mydb.commit()

In [13]:
cur.execute("Insert into test VALUES(8,'Rushi','2022-06-08')")

In [14]:
cur.execute("Insert into test VALUES(15,'Sangam','2022-06-08')")
cur.execute("Insert into test VALUES(87,'Viraj','2022-06-08')")
cur.execute("Insert into test VALUES(98,'Pritam','2022-06-08')")
cur.execute("Insert into test VALUES(54,'Suchit','2022-06-08')")
cur.execute("Insert into test VALUES(34,'Vandana','2022-06-08')")
cur.execute("Insert into test VALUES(9,'Saurabh','2022-06-08')")
cur.execute("Insert into test VALUES(6,'Musab','2022-06-08')")

In [15]:
mydb.commit()

Fetch the Data

In [16]:
cur.execute("select *from test")
cur.fetchall()

[(5, 'HI', datetime.date(2022, 6, 8)),
 (8, 'Rushi', datetime.date(2022, 6, 8)),
 (15, 'Sangam', datetime.date(2022, 6, 8)),
 (87, 'Viraj', datetime.date(2022, 6, 8)),
 (98, 'Pritam', datetime.date(2022, 6, 8)),
 (54, 'Suchit', datetime.date(2022, 6, 8)),
 (34, 'Vandana', datetime.date(2022, 6, 8)),
 (9, 'Saurabh', datetime.date(2022, 6, 8)),
 (6, 'Musab', datetime.date(2022, 6, 8))]

In [17]:
cur.execute("select x1,x2 from test")
for i in cur.fetchall():
    print(i)

(5, 'HI')
(8, 'Rushi')
(15, 'Sangam')
(87, 'Viraj')
(98, 'Pritam')
(54, 'Suchit')
(34, 'Vandana')
(9, 'Saurabh')
(6, 'Musab')

In [18]:
import pandas as pd
import csv

In [19]:
mydb.is_connected()

True

In [20]:
a = pd.read_sql("select *from Student.test",mydb)
a

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\561146104.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  a = pd.read_sql("select *from Student.test",mydb)

   x1       x2          x3
0   5       HI  2022-06-08
1   8    Rushi  2022-06-08
2  15   Sangam  2022-06-08
3  87    Viraj  2022-06-08
4  98   Pritam  2022-06-08
5  54   Suchit  2022-06-08
6  34  Vandana  2022-06-08
7   9  Saurabh  2022-06-08
8   6    Musab  2022-06-08

In [21]:
a.to_csv("mydata.csv")

In [22]:
cur = mydb.cursor()
cur.execute("Create table mydata(n1 int(20) , n2 varchar(20), n3 date)")

In [23]:
data = pd.read_csv('mydata.csv')
data

   Unnamed: 0  x1       x2          x3
0           0   5       HI  2022-06-08
1           1   8    Rushi  2022-06-08
2           2  15   Sangam  2022-06-08
3           3  87    Viraj  2022-06-08
4           4  98   Pritam  2022-06-08
5           5  54   Suchit  2022-06-08
6           6  34  Vandana  2022-06-08
7           7   9  Saurabh  2022-06-08
8           8   6    Musab  2022-06-08

In [24]:
pd.read_sql('select *from test',mydb)

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\747805077.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql('select *from test',mydb)

   x1       x2          x3
0   5       HI  2022-06-08
1   8    Rushi  2022-06-08
2  15   Sangam  2022-06-08
3  87    Viraj  2022-06-08
4  98   Pritam  2022-06-08
5  54   Suchit  2022-06-08
6  34  Vandana  2022-06-08
7   9  Saurabh  2022-06-08
8   6    Musab  2022-06-08

In [25]:
import mysql.connector as connection
mydb = connection.connect(host="localhost" , user="root", passwd="R@ud!n$0903",use_pure=True)
mydb.is_connected()

True

In [26]:
cur = mydb.cursor()
cur.execute("Drop Database IF EXISTS Glass")
cur.execute("Create Database Glass")
cur.execute("CREATE TABLE Glass.GlassData (Index_Number INT(10),RI float(10,5), Na float(10,5), Mg float(10,5),Al float(10,5)," \
            " Si float(10,5), K float(10,5), Ca float(10,5), Ba float(10,5), Fe float(10,5), Class INT(5))")

In [27]:
import csv
with open("D:\Programs\Python\Python_Fast_Track\DataBase\glass.data","r") as data:
    next(data)
    data_csv = csv.reader(data,delimiter="\n")
    print(data_csv)
    for i in enumerate(data_csv):
        #print(i)
        for j in i[1]:
            #print(type(j))
            cur.execute('insert into Glass.GlassData values ({data})'.format(data=(j)))
    print("all the data inserted ")
mydb.commit()

<_csv.reader object at 0x000001DA3F26CC40>
all the data inserted

In [28]:
import csv
cur = mydb.cursor()
cur.execute("CREATE TABLE Glass.GlassData1 (Index_Number INT(10),RI float(10,5), Na float(10,5), Mg float(10,5),Al float(10,5)," \
            " Si float(10,5), K float(10,5), Ca float(10,5), Ba float(10,5), Fe float(10,5), Class INT(5))")
with open("D:\Programs\Python\Python_Fast_Track\DataBase\glass.data","r") as data:
    next(data)
    data_csv = csv.reader(data,delimiter="\n")
    print(data_csv)
    for j in data_csv:
        cur.execute("insert into Glass.GlassData1 values({data})".format(data=(str(j[0]))))
    print("all the data inserted")
mydb.commit()

<_csv.reader object at 0x000001DA47A65DE0>
all the data inserted

9/6/2022

In [29]:
import mysql.connector as connect 
mydb = connection.connect(host="localhost" , user = "root" ,passwd = "R@ud!n$0903" ,use_pure = True)
mydb.is_connected()

True

In [30]:
cur = mydb.cursor()
cur.execute("Drop Database IF EXISTS raudin1")
cur.execute("Create DataBase raudin1")

In [31]:
mydb = connection.connect(host="localhost",database="raudin1",user="root",passwd="R@ud!n$0903",use_pure=True)
cur = mydb.cursor()
cur.execute("Create Table Book(bookid int(4),Title varchar(20) , Price float(5,2))")

In [32]:
cur.execute("INSERT INTO BOOK(bookid,Title,Price) VALUES (1,'Python',345)")
mydb.commit()

In [33]:
S = "INSERT INTO BOOK(bookid,Title,Price) VALUES (%s,%s,%s)"
books = [(2,'Statistics',135),(3,'Machine Learning',450),(4,'NLP',200),(5,'CV',267),(6,'AIOPS',324)]
cur.executemany(S,books)
mydb.commit()

In [34]:
cur.execute("Select *from book")
result = cur.fetchall()
result

[(1, 'Python', 345.0),
 (2, 'Statistics', 135.0),
 (3, 'Machine Learning', 450.0),
 (4, 'NLP', 200.0),
 (5, 'CV', 267.0),
 (6, 'AIOPS', 324.0)]

In [35]:
cur.execute("UPDATE book SET Price = Price+10 WHERE Price >= 200")
mydb.commit()

In [36]:
cur.execute("Select *from book")
result = cur.fetchall()
result

[(1, 'Python', 355.0),
 (2, 'Statistics', 135.0),
 (3, 'Machine Learning', 460.0),
 (4, 'NLP', 210.0),
 (5, 'CV', 277.0),
 (6, 'AIOPS', 334.0)]

In [37]:
cur.execute("DELETE FROM book WHERE Price < 200")
mydb.commit()

In [38]:
pwd

'd:\\Programs\\Python\\Python_Fast_Track\\DataBase'

### Carbon Nanotubes Data

https://archive.ics.uci.edu/ml/machine-learning-databases/00448/

In [46]:
import mysql.connector as connection
import csv
import logging as lg
import os 

#if os.path.exists('database.log'):
    #os.remove('database.log')

lg.basicConfig(filename = 'database.log',level=lg.INFO,format='%(asctime)s - %(message)s')
console_log = lg.StreamHandler()
console_log.setLevel(lg.DEBUG)
format = lg.Formatter('%(asctime)s - %(message)s')
console_log.setFormatter(format)
lg.getLogger('').addHandler(console_log)
lg.info("Logging Started")

try:
    mydb = connection.connect(host="localhost",user="root",passwd="R@ud!n$0903",use_pure = True)
    if mydb.is_connected():
        lg.info('Establishing connection........')
        cur = mydb.cursor()
        cur.execute("Drop Database IF EXISTS Carbon")
        cur.execute("Create DataBase Carbon")
        lg.info("DataBase Created!!")
        
        mydb = connection.connect(host="localhost",user="root",database="Carbon",passwd="R@ud!n$0903")
        cur = mydb.cursor()
        lg.info('Connection Established with the database!!')

        cur.execute('Drop TABLE IF EXISTS carbon_Nanotubes')
        lg.info('Creating Table.......')
        cur.execute("Create Table carbon_nanotubes(Chiral_indice_n INT(7), Chiracl_indice_m INT(7),Initial_atomic_coordinate_u INT(7),Initial_atomic_coordinate_v INT(7),Initial_atomic_coordinate_w INT(7),Calculated_atomic_coordinate_u INT(7),Calculated_atomic_coordiante_v INT(7),Calculated_atomic_coordinate_w INT(7))")
        lg.info("Table Created!!")
        
        with open('D:\Programs\Python\Python_Fast_Track\DataBase\carbon_nanotubes.csv','r') as data: # with open('carbon_nanotubes.csv','r') as data:
            lg.info('Starting Record insertion....\n')
            next(data)
            data_csv = csv.reader(data,delimiter='\n')
            for num,record in enumerate(data_csv,start = 1):
                rec = record[0].split(';')
                record_processed = [int(i.split(',')[1]) if len(i.split(',')) > 1 else int(i) for i in rec]
                record_processed = ','.join([str(elem) for elem in record_processed])
                cur.execute("Insert Into carbon_nanotubes values({values})".format(values = record_processed))
                
        lg.info(f'Record {num} Inserted')
        lg.info("All Records Inserted")
        mydb.commit()

except Exception as e:
    lg.error(str(e))
    mydb.close()

finally:
    if mydb.is_connected():
        cur.close()
        lg.info("Connection Closed")
        lg.shutdown()

2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,824 - Logging Started
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,856 - Establishing connection........
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,872 - DataBase Created!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,895 - Connection Established with the database!!
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,905 - Creating Table.......
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Table Created!!
2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:48,939 - Starting Record insertion....

2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,765 - Record 10721 Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,780 - All Records Inserted
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed
2024-10-01 17:11:50,784 - Connection Closed

In [47]:
import mysql.connector as connect
import pandas as pd
import csv 
mydb = connect.connect(host="localhost",database="Carbon",user="root",passwd="R@ud!n$0903")
print(mydb.is_connected())
a = pd.read_sql("select *from Carbon.carbon_nanotubes",mydb)
print(a)
a.to_csv("New_Carbon_nanotubes.csv")

True
       Chiral_indice_n  Chiracl_indice_m  Initial_atomic_coordinate_u  \
0                    2                 1                       679005
1                    2                 1                       717298
2                    2                 1                       489336
3                    2                 1                       413957
4                    2                 1                       334292
...                ...               ...                          ...
10716               12                 6                       834201
10717               12                 6                       698374
10718               12                 6                       923823
10719               12                 6                       934978
10720               12                 6                       953664

       Initial_atomic_coordinate_v  Initial_atomic_coordinate_w  \
0                           701318                        17033
1                           642129                       231319
2                           303751                        88462
3                           632996                        40843
4                           543401                        15989
...                            ...                          ...
10716                       399891                        89127
10717                        24471                       962699
10718                       568913                       819842
10719                       602319                       938889
10720                       698374                       962699

       Calculated_atomic_coordinate_u  Calculated_atomic_coordiante_v  \
0                              721039                          730232
1                              738414                           65675
2                              477676                          263221
3                              408823                          657897
4                              303349                          558807
...                               ...                             ...
10716                          841858                          405882
10717                          706555                          248416
10718                          929403                          576284
10719                          941844                          610608
10720                          961243                          707812

       Calculated_atomic_coordinate_w
0                               17014
1                              232369
2                               88712
3                               39796
4                              157373
...                               ...
10716                          891356
10717                          962833
10718                          819879
10719                          938755
10720                          962605

[10721 rows x 8 columns]

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\1936155289.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  a = pd.read_sql("select *from Carbon.carbon_nanotubes",mydb)

In [48]:
data = pd.read_csv('New_Carbon_nanotubes.csv')
data

,Unnamed: 0,Chiral_indice_n,Chiracl_indice_m,Initial_atomic_coordinate_u,Initial_atomic_coordinate_v,Initial_atomic_coordinate_w,Calculated_atomic_coordinate_u,Calculated_atomic_coordiante_v,Calculated_atomic_coordinate_w
0,0,2,1,679005,701318,17033,721039,730232,17014
1,1,2,1,717298,642129,231319,738414,65675,232369
2,2,2,1,489336,303751,88462,477676,263221,88712
3,3,2,1,413957,632996,40843,408823,657897,39796
4,4,2,1,334292,543401,15989,303349,558807,157373
...,...,...,...,...,...,...,...,...,...
10716,10716,12,6,834201,399891,89127,841858,405882,891356
10717,10717,12,6,698374,24471,962699,706555,248416,962833
10718,10718,12,6,923823,568913,819842,929403,576284,819879
10719,10719,12,6,934978,602319,938889,941844,610608,938755
10720,10720,12,6,953664,698374,962699,961243,707812,962605

### Pymysql

In [50]:
import pymysql
import pandas as pd

In [54]:
dbcon = pymysql.connect(host="localhost",user="root",password="R@ud!n$0903",database="Carbon")
dbcon

In [55]:
data = pd.read_sql_query("SELECT *FROM carbon_nanotubes",dbcon,parse_dates=True)
data

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\2065392760.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query("SELECT *FROM carbon_nanotubes",dbcon,parse_dates=True)

,Chiral_indice_n,Chiracl_indice_m,Initial_atomic_coordinate_u,Initial_atomic_coordinate_v,Initial_atomic_coordinate_w,Calculated_atomic_coordinate_u,Calculated_atomic_coordiante_v,Calculated_atomic_coordinate_w
0,2,1,679005,701318,17033,721039,730232,17014
1,2,1,717298,642129,231319,738414,65675,232369
2,2,1,489336,303751,88462,477676,263221,88712
3,2,1,413957,632996,40843,408823,657897,39796
4,2,1,334292,543401,15989,303349,558807,157373
...,...,...,...,...,...,...,...,...
10716,12,6,834201,399891,89127,841858,405882,891356
10717,12,6,698374,24471,962699,706555,248416,962833
10718,12,6,923823,568913,819842,929403,576284,819879
10719,12,6,934978,602319,938889,941844,610608,938755
10720,12,6,953664,698374,962699,961243,707812,962605

In [56]:
data.shape

(10721, 8)

In [57]:
data.describe()

,Chiral_indice_n,Chiracl_indice_m,Initial_atomic_coordinate_u,Initial_atomic_coordinate_v,Initial_atomic_coordinate_w,Calculated_atomic_coordinate_u,Calculated_atomic_coordiante_v,Calculated_atomic_coordinate_w
count,10721.000000,10721.000000,10721.000000,10721.000000,10721.000000,10721.000000,10721.000000,10721.000000
mean,8.225725,3.337189,454784.941610,454988.835556,454033.984330,454798.147654,456266.137114,453052.988620
std,2.138919,1.683881,304380.714928,304358.377385,305605.951651,308013.491572,308387.137917,306861.413361
min,2.000000,1.000000,158.000000,225.000000,52.000000,32.000000,225.000000,0.000000
25%,7.000000,2.000000,156502.000000,157965.000000,166728.000000,150393.000000,151589.000000,164284.000000
50%,8.000000,3.000000,431087.000000,427737.000000,444445.000000,430111.000000,429792.000000,442666.000000
75%,10.000000,5.000000,756414.000000,757776.000000,720355.000000,759154.000000,765037.000000,720787.000000
max,12.000000,6.000000,954851.000000,954851.000000,999411.000000,961496.000000,960959.000000,999611.000000

In [60]:
dbcon = pymysql.connect(host="localhost",user="root",password="R@ud!n$0903",database="glass")
dbcon

In [61]:
df1 = pd.read_sql_query("SELECT *FROM glassdata",dbcon,parse_dates=True)
df1.head()

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\2920194139.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df1 = pd.read_sql_query("SELECT *FROM glassdata",dbcon,parse_dates=True)

,Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class
0,1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.0,0.0,1
1,2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.0,0.0,1
2,3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.0,0.0,1
3,4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.0,0.0,1
4,5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.0,0.0,1

In [62]:
df2= pd.read_sql_query("SELECT *FROM glassdata1",dbcon,parse_dates=True)
df2.head()

C:\Users\Rushikesh\AppData\Local\Temp\ipykernel_1748\3415266005.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2= pd.read_sql_query("SELECT *FROM glassdata1",dbcon,parse_dates=True)

,Index_Number,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe,Class
0,1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.0,0.0,1
1,2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.0,0.0,1
2,3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.0,0.0,1
3,4,1.51766,13.21,3.69,1.29,72.61,0.57,8.22,0.0,0.0,1
4,5,1.51742,13.27,3.62,1.24,73.08,0.55,8.07,0.0,0.0,1

In [65]:
final_df = pd.merge(df1,df2,on='RI',how='inner')
final_df.head()

,Index_Number_x,RI,Na_x,Mg_x,Al_x,Si_x,K_x,Ca_x,Ba_x,Fe_x,...,Index_Number_y,Na_y,Mg_y,Al_y,Si_y,K_y,Ca_y,Ba_y,Fe_y,Class_y
0,1,1.52101,13.64,4.49,1.10,71.78,0.06,8.75,0.0,0.0,...,1,13.64,4.49,1.10,71.78,0.06,8.75,0.0,0.0,1
1,2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.0,0.0,...,2,13.89,3.60,1.36,72.73,0.48,7.83,0.0,0.0,1
2,2,1.51761,13.89,3.60,1.36,72.73,0.48,7.83,0.0,0.0,...,16,12.81,3.54,1.23,73.24,0.58,8.39,0.0,0.0,1
3,3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.0,0.0,...,3,13.53,3.55,1.54,72.99,0.39,7.78,0.0,0.0,1
4,3,1.51618,13.53,3.55,1.54,72.99,0.39,7.78,0.0,0.0,...,89,13.01,3.50,1.48,72.89,0.60,8.12,0.0,0.0,2

In [66]:
dbcon.close()

### Pymongo  MongoDB

In [1]:
# !python -m pip install pymongo

In [ ]:
%pip install pymongo[srv]

### MongoDB Compass

In [67]:
import pymongo
#client = pymongo.MongoClient("mongodb://localhost:27017")
client = pymongo.MongoClient("mongodb+srv://Rushi:Rushi0903@cluster0.xqteb.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0")
client

MongoClient(host=['cluster0-shard-00-00.xqteb.mongodb.net:27017', 'cluster0-shard-00-02.xqteb.mongodb.net:27017', 'cluster0-shard-00-01.xqteb.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', appname='Cluster0', authsource='admin', replicaset='atlas-zrgnq9-shard-0', tls=True)

### STEP 1: Create a DB

In [68]:
db_1 = client["Rushikesh"]

In [69]:
client.list_database_names()

['admin', 'local']

### STEP 2: Create a collection

In [70]:
collection = db_1["Test"]
collection

Collection(Database(MongoClient(host=['cluster0-shard-00-00.xqteb.mongodb.net:27017', 'cluster0-shard-00-02.xqteb.mongodb.net:27017', 'cluster0-shard-00-01.xqteb.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', appname='Cluster0', authsource='admin', replicaset='atlas-zrgnq9-shard-0', tls=True), 'Rushikesh'), 'Test')

### STEP 3: Insert a record in the collection

In [71]:
record = {'companyName':'iNeuron','product':'Affordable AI','courseoffered':'Deep Learnning for Computer vision'}
collection.insert_one(record)

In [72]:
record = {'companyName':'iNeuron','product':'Affordable AI',
        'courseoffered':'Deep Learnning for Computer vision',
        'name':["Rushi","Sunny",985643]}
collection.insert_one(record)

### STEP 4: Insert multiple records

In [73]:
list_of_records = [
    {'companyName': 'iNeuron',
     'product': 'Affordable AI',
     'courseOffered': 'Machine Learning with Deployment'},
    
    {'companyName': 'iNeuron',
     'product': 'Affordable AI',
     'courseOffered': 'Deep Learning for NLP and Computer vision'},
    
    {'companyName': 'iNeuron',
     'product': 'Master Program',
     'courseOffered': 'Data Science Masters Program',
    "test" : "ffsdfsffsf",
     "complex" : [{"name" : "sudhanshu","list" : [554,545,454,54,5,4]},{"email_id" :"sudhanshu@dffsf"},{"phone_no":345345345353},[4,54,534,5,45,5,45,4]]
    }]
    
rec = collection.insert_many(list_of_records)

In [74]:
collection.find_one()

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'),
 'companyName': 'iNeuron',
 'product': 'Affordable AI',
 'courseoffered': 'Deep Learnning for Computer vision'}

In [75]:
# lets print the unique ID that of the record that we have inserted -

inserted_IDs = rec.inserted_ids

for idx, unique_ids in enumerate(inserted_IDs):
    print(f"{idx}. {unique_ids}")

0. 66fbe6679ed1bdf7272abb72
1. 66fbe6679ed1bdf7272abb73
2. 66fbe6679ed1bdf7272abb74

In [76]:
COLLECTION_NAME = "iNeuron_Faculties"
faculties = db_1[COLLECTION_NAME]

list_of_records_user_defined_id = [
    {"_id": "6",
    "companyName": "iNeuron",
    "Faculty": "Sudhanshu Kumar"},
    {"_id": "8",
    "companyName": "iNeuron",
    "Faculty": "Virat Sagar"},
]

faculties_record = faculties.insert_many(list_of_records_user_defined_id)

### STEP 5: Find method in MongoDB

In [77]:
find_first_record = faculties.find_one()

print(f"The first record of collection: \n{COLLECTION_NAME} is=\
\n{find_first_record}")

The first record of collection:
iNeuron_Faculties is=
{'_id': '6', 'companyName': 'iNeuron', 'Faculty': 'Sudhanshu Kumar'}

In [78]:
for i in faculties.find():
    print(i)

{'_id': '6', 'companyName': 'iNeuron', 'Faculty': 'Sudhanshu Kumar'}
{'_id': '8', 'companyName': 'iNeuron', 'Faculty': 'Virat Sagar'}

In [79]:
for i in collection.find():
    print(i)

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision'}
{'_id': ObjectId('66fbe64e9ed1bdf7272abb71'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision', 'name': ['Rushi', 'Sunny', 985643]}
{'_id': ObjectId('66fbe6679ed1bdf7272abb72'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'Machine Learning with Deployment'}
{'_id': ObjectId('66fbe6679ed1bdf7272abb73'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'Deep Learning for NLP and Computer vision'}
{'_id': ObjectId('66fbe6679ed1bdf7272abb74'), 'companyName': 'iNeuron', 'product': 'Master Program', 'courseOffered': 'Data Science Masters Program', 'test': 'ffsdfsffsf', 'complex': [{'name': 'sudhanshu', 'list': [554, 545, 454, 54, 5, 4]}, {'email_id': 'sudhanshu@dffsf'}, {'phone_no': 345345345353}, [4, 54, 534, 5, 45, 5, 45, 4]]}

### STEP 6: Query or filter out data in MongoDB

In [80]:
for i in faculties.find({'Faculty':"Virat Sagar"}):
    print(i)

{'_id': '8', 'companyName': 'iNeuron', 'Faculty': 'Virat Sagar'}

In [81]:
for i in faculties.find({'_id':{'$gt':'1'}}):
    print(i)

{'_id': '6', 'companyName': 'iNeuron', 'Faculty': 'Sudhanshu Kumar'}
{'_id': '8', 'companyName': 'iNeuron', 'Faculty': 'Virat Sagar'}

In [82]:
# Lets add some random data in faculties
random_data = [
    {'_id': '3', 'companyName': 'iNeuron', 'Faculty': 'XYZ'},
    {'_id': '4', 'companyName': 'iNeuron', 'Faculty': 'ABC'},
    {'_id': '5', 'companyName': 'iNeuron', 'Faculty': 'PQR'},
]

faculties.insert_many(random_data)

### STEP 7: Delete one or many documents in MongoDB

In [83]:
# Lets delete one document in faculties
query_to_delete = {"Faculty": "XYZ"}

faculties.delete_one(query_to_delete)

In [84]:
for i in faculties.find({"_id": {"$gte": "3"}}):
    print(i)

{'_id': '4', 'companyName': 'iNeuron', 'Faculty': 'ABC'}
{'_id': '5', 'companyName': 'iNeuron', 'Faculty': 'PQR'}
{'_id': '6', 'companyName': 'iNeuron', 'Faculty': 'Sudhanshu Kumar'}
{'_id': '8', 'companyName': 'iNeuron', 'Faculty': 'Virat Sagar'}

In [85]:
faculties.delete_many({"_id": {"$gte": "6"}})

In [86]:
multi_query_to_delete = {"_id":{"$gte":"6"}}
faculties.delete_many(multi_query_to_delete)

### STEP 8: Drop the entire collection

In [87]:
faculties.drop()

### STEP 9: Update

In [88]:
COLLECTION_NAME = "Test"

products = db_1[COLLECTION_NAME]

all_record = products.find()

for idx, record in enumerate(all_record):
    print(f"{record}\n")

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision'}

{'_id': ObjectId('66fbe64e9ed1bdf7272abb71'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision', 'name': ['Rushi', 'Sunny', 985643]}

{'_id': ObjectId('66fbe6679ed1bdf7272abb72'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'Machine Learning with Deployment'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb73'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'Deep Learning for NLP and Computer vision'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb74'), 'companyName': 'iNeuron', 'product': 'Master Program', 'courseOffered': 'Data Science Masters Program', 'test': 'ffsdfsffsf', 'complex': [{'name': 'sudhanshu', 'list': [554, 545, 454, 54, 5, 4]}, {'email_id': 'sudhanshu@dffsf'}, {'phone_no': 345345345353}, [4, 54, 534, 5, 45, 5, 45, 4]]}

In [89]:
present_data = {'courseOffered': 'Machine Learning with Deployment'}
new_data = {"$set":{'courseOffered': 'ML and DL with Deployment'}}

In [90]:
products.update_one(present_data, new_data)

In [91]:
all_record = products.find()

for idx, record in enumerate(all_record):
    print(f"{record}\n")

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision'}

{'_id': ObjectId('66fbe64e9ed1bdf7272abb71'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision', 'name': ['Rushi', 'Sunny', 985643]}

{'_id': ObjectId('66fbe6679ed1bdf7272abb72'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'ML and DL with Deployment'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb73'), 'companyName': 'iNeuron', 'product': 'Affordable AI', 'courseOffered': 'Deep Learning for NLP and Computer vision'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb74'), 'companyName': 'iNeuron', 'product': 'Master Program', 'courseOffered': 'Data Science Masters Program', 'test': 'ffsdfsffsf', 'complex': [{'name': 'sudhanshu', 'list': [554, 545, 454, 54, 5, 4]}, {'email_id': 'sudhanshu@dffsf'}, {'phone_no': 345345345353}, [4, 54, 534, 5, 45, 5, 45, 4]]}

In [92]:
present_data = {'companyName': 'iNeuron'}
new_data = {"$set": {'companyName': 'iNeuron.ai'}}
products.update_many(present_data, new_data)

In [93]:
all_record = products.find()

for idx, record in enumerate(all_record):
    print(f"{record}\n")

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision'}

{'_id': ObjectId('66fbe64e9ed1bdf7272abb71'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision', 'name': ['Rushi', 'Sunny', 985643]}

{'_id': ObjectId('66fbe6679ed1bdf7272abb72'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseOffered': 'ML and DL with Deployment'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb73'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseOffered': 'Deep Learning for NLP and Computer vision'}

{'_id': ObjectId('66fbe6679ed1bdf7272abb74'), 'companyName': 'iNeuron.ai', 'product': 'Master Program', 'courseOffered': 'Data Science Masters Program', 'test': 'ffsdfsffsf', 'complex': [{'name': 'sudhanshu', 'list': [554, 545, 454, 54, 5, 4]}, {'email_id': 'sudhanshu@dffsf'}, {'phone_no': 345345345353}, [4, 54, 534, 5, 45, 5, 45, 4]]}

### STEP 9: Set limit to view N records

In [94]:
N_records = 3

N_record = products.find().limit(N_records)

for idx, record in enumerate(N_record):
    print(f"{record}\n")

{'_id': ObjectId('66fbe63c9ed1bdf7272abb70'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision'}

{'_id': ObjectId('66fbe64e9ed1bdf7272abb71'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseoffered': 'Deep Learnning for Computer vision', 'name': ['Rushi', 'Sunny', 985643]}

{'_id': ObjectId('66fbe6679ed1bdf7272abb72'), 'companyName': 'iNeuron.ai', 'product': 'Affordable AI', 'courseOffered': 'ML and DL with Deployment'}

14/6/2022

In [1]:
import pymongo
client = pymongo.MongoClient('mongodb://127.0.0.1:27017/')
mydb = client['Employee']

In [2]:
information = mydb.empinfo

In [ ]:
record = { 'firstname':'Rushi','lastname':'Khandare','department':'AI Engineer'}
information.insert_one(record)

In [ ]:
records = [{'firstname':'Krish','lastname':'Naik','department':'Analytics'},
           {'firstname':'Sudhanshu','lastname':'Kumar','department':'CEO of iNeuron'},
           {'firstname':'Hitesh','lastname':'Chaudhary','department':'CTO of iNeuron'}]
information.insert_many(records)

In [ ]:
records = [{'firstname':'Sunny','lastname':'Dhalape','department':'Analytics','qualification':'BSC','age':22},
           {'firstname':'Snehal','lastname':'Randive','department':'Civil','qualificatin':'BE','age':24},
           {'firstname':'Ramkrishna','lastname':'Pise','department':'IT','qualification':'BE','age':21},
           {'firstname':'Ketaki','lastname':'Badave','department':'Software Development','qualification':'phd','age':27},
           {'firstname':'Vinod','lastname':'Khandare','department':'ICICI','qualification':'B.COM','age':36},
           {'firstname':'Aniket','lastname':'Changan','department':'Agriculture','qualification':'BSC','age':22}]
information.insert_many(records)

In [ ]:
information.find_one()

In [ ]:
for i in information.find({}):
    print(i)

In [ ]:
for i in information.find({'firstname':'Rushi'}):
    print(i)

In [ ]:
for i in information.find({'qualification':{'$in':['phd','BE']}}):
    print(i)

In [ ]:
for i in information.find({'qualification':'BSC','age':{'$lt':25}}):
    print(i)

In [ ]:
for i in information.find({'$or':[{'firstname':'Snehal'},{'qualification':'BE'}]}):
    print(i)

In [17]:
inventory = mydb.inventory

In [ ]:
inventory.insert_many( [
   { 'item': "journal", 'qty': 25, 'size': { 'h': 14, 'w': 21,'uom': "cm" }, 'status': "A" },
   { 'item': "notebook", 'qty': 50,'size': { 'h': 8.5, 'w': 11,'uom': "in" },'status': "A" },
   { 'item': "paper", 'qty': 100, 'size': { 'h': 8.5, 'w': 11,'uom': "in" },'status': "D" },
   { 'item': "planner", 'qty': 75, 'size': { 'h': 22.85,'w': 30,'uom': "cm" },'status': "D" },
   { 'item': "postcard", 'qty': 45, 'size': { 'h': 10, 'w': 15.25,'uom': "cm" },'status': "A" }
])

In [ ]:
inventory.insert_many([
    {"item": "canvas",
     "qty": 100,
     "size": {"h": 28, "w": 35.5, "uom": "cm"},
     "status": "A"},
    {"item": "mat",
     "qty": 85,
     "size": {"h": 27.9, "w": 35.5, "uom": "cm"},
     "status": "A"},
    {"item": "mousepad",
     "qty": 25,
     "size": {"h": 19, "w": 22.85, "uom": "cm"},
     "status": "P"},
    {"item": "sketchbook",
     "qty": 80,
     "size": {"h": 14, "w": 21, "uom": "cm"},
     "status": "A"},
    {"item": "sketch pad",
     "qty": 95,
     "size": {"h": 22.85, "w": 30.5, "uom": "cm"},
     "status": "A"}])

In [ ]:
for i in inventory.find({'qty':100}):
    print(i)

### MongoDb with python Updating Json Documents
Functions to Discuss
1. pymongo.collection.Collection.update_one()
2. pymongo.collection.Collection.update_many()
3. pymongo.collection.Collection.replace_one()

In [ ]:
inventory.update_one({'item':'canvas'},{'$set':{'size.uom':'m','status':'P'},'$currentDate':{'lastModified':True}})

In [ ]:
for i in inventory.find({'item':'canvas'}):
    print(i)

In [ ]:
inventory.update_many({'qty':{'$lt':50}},{'$set':{'size.uom':'in','status':'P'},'$currentDate':{'lastModified':True}})

In [ ]:
for i in inventory.find({'qty':{'$lt':50}}):
    print(i)

In [ ]:
inventory.replace_one({'item':'paper'},{'item':'paper','instock':[{'warehouse':'A','qty':60},{'warehouse':'B','qty':'40'}]})

In [ ]:
for i in inventory.find({'item':'paper'}):
    print(i)

### Mongodb Aggregate And Group
1. avg
2. sum
3. project

In [ ]:
import pymongo
client = pymongo.MongoClient("mongodb://localhost:27017/")  
mydatabase = client['Students1']  
collection = mydatabase['studentscores']  
data = [ 
    {"user":"Krish", "subject":"Database", "score":80}, 
    {"user":"Amit",  "subject":"JavaScript", "score":90}, 
    {"user":"Amit",  "title":"Database", "score":85}, 
    {"user":"Krish",  "title":"JavaScript", "score":75}, 
    {"user":"Amit",  "title":"Data Science", "score":60},
    {"user":"Krish",  "title":"Data Science", "score":95}] 
  
collection.insert_many(data)

In [ ]:
for i in collection.find({}):
    print(i)

In [ ]:
agg_result = collection.aggregate([{'$group':{'_id':'$user','Total Subject':{'$sum':1}}}])

for i in agg_result:
    print(i)

In [ ]:
agg_result = collection.aggregate([{'$group':{'_id':'$user','Total Marks':{'$sum':'$score'}}}])

for i in agg_result:
    print(i)

In [ ]:
agg_result = collection.aggregate([{'$group':{'_id':'$user','StudentScoreAverage':{'$avg':'$score'}}}])

for i in agg_result:
    print(i)

In [46]:
import datetime as datetime

In [47]:
data=[{ "_id" : 1, "item" : "abc", "price" : 10, "quantity" : 2, "date" : datetime.datetime.utcnow()},
{ "_id" : 2, "item" : "jkl", "price" : 20, "quantity" : 1, "date" : datetime.datetime.utcnow() },
{ "_id" : 3, "item" : "xyz", "price" : 5, "quantity" : 5, "date" : datetime.datetime.utcnow() },
{ "_id" : 4, "item" : "abc", "price" : 10, "quantity" : 10, "date" : datetime.datetime.utcnow() },
{ "_id" : 5, "item" : "xyz", "price" : 5, "quantity" : 10, "date" :datetime.datetime.utcnow() }]

In [ ]:
data

In [ ]:
mycollection = mydatabase['Stores']
mycollection.insert_many(data)

In [ ]:
for i in mycollection.find({}):
    print(i)

In [ ]:
agg_result = mycollection.aggregate([{'$group':{'_id':'$item','avgAmount':{'$avg':{'$multiply':['$price','$quantity']}},
                                      'avgQuantity':{'$avg':'$quantity'}}}])

for i in agg_result:
    print(i)

In [ ]:
#### $Project

data=[{
  "_id" : 1,
  "title": "abc123",
  "isbn": "0001122223334",
  "author": { "last": "zzz", "first": "aaa" },
  "copies": 5
},
{
  "_id" : 2,
  "title": "Baked Goods",
  "isbn": "9999999999999",
  "author": { "last": "xyz", "first": "abc", "middle": "" },
  "copies": 2
}]

collection = mydatabase['Books']
collection.insert_many(data)

In [ ]:
for row in collection.aggregate( [ { "$project": { "title": 1,"isbn":1 } } ] ):
    print(row)

## Cassandra Datastax Cloud

In [ ]:
!pip install cassandra-driver

In [ ]:
import cassandra 
print (cassandra.__version__)

In [ ]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': 'D:\Python Programs\Basic\DataBase\secure-connect-datascience.zip'
}
auth_provider = PlainTextAuthProvider('DUazUsATrhptYnfuFWsfTkiq', 'w8AuD9fvCiJlgnLD,CjWDXYmw7gM1RX_2-opdpE6yyzBdhmDk6KZ3cY3bht3w_91MlLZ91KM07lKpwPv+0cGh5ZH35imr5G2Lcdc+CPZL4CIA8_TqaYib_kff8o9HTPp')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local").one()
if row:
    print(row[0])
else:
    print("An error occurred.")

In [ ]:
# create keyspace in database

row = session.execute("CREATE KEYSPACE home1 WITH replication = {'class': 'NetworkTopologyStrategy', 'asia-south1': '3'}  AND durable_writes = true;")

In [32]:
#use keyspace
row=session.execute("use home")

In [ ]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': 'D:\Python Programs\Basic\DataBase\secure-connect-datascience.zip'
}
auth_provider = PlainTextAuthProvider('DUazUsATrhptYnfuFWsfTkiq', 'w8AuD9fvCiJlgnLD,CjWDXYmw7gM1RX_2-opdpE6yyzBdhmDk6KZ3cY3bht3w_91MlLZ91KM07lKpwPv+0cGh5ZH35imr5G2Lcdc+CPZL4CIA8_TqaYib_kff8o9HTPp')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

# create keyspace in database
row = session.execute("select release_version from system.local").one()
print(row)

In [33]:
#use keyspace
row=session.execute("use home")

In [ ]:
row = session.execute("SELECT*FROM system_schema.keyspaces").one()
print(row)

## Create a Table into home Database

In [ ]:
row = session.execute(" CREATE TABLE home.emp123(emp_id int PRIMARY KEY,emp_name text,emp_city text,emp_sal varint,emp_phone varint);").one()
print(row)

## Insert data in Table

In [41]:
row = session.execute("insert into home.emp123(emp_id,emp_name,emp_city,emp_sal,emp_phone) VALUES(%s,%s,%s,%s,%s)",[1,'Rushi','Mumbai',75000,984534])

In [48]:
i1 = "insert into home.emp123(emp_id,emp_name,emp_city,emp_sal,emp_phone) VALUES(%s,%s,%s,%s,%s)"
v1 = [2,'Saurabh','Mumbai',73000,984535]
v2 = [3,'Snehal','Pune',78000,984536]
v3 = [4,'Ramkrishna','Pune',76000,984537]
v4 = [5,'Musab','Kolkata',45000,984538]
row = session.execute(i1,v4)

### Select all data from a table

In [ ]:
row = session.execute('Select *from home.emp123')
for i in row:
    print(i[0],'|',i[1],'|',i[2],'|',i[3],'|',i[4])

### Select a Specific record

In [ ]:
ss= session.prepare("select * from  home.emp123 where emp_id = ? ;")

res= session.execute(ss,[3])
for i in res:
    print(i[0],'|',i[1],'|',i[2],'|',i[3],'|',i[4])

### Update a record in Emp

In [ ]:
prepare_st= "update home.emp123 SET emp_sal= ?,emp_name= ? where emp_id= ? ;"
prepare_ud= session.prepare(prepare_st)
session.execute(prepare_ud,[74000,'Musab',5])

In [ ]:
row = session.execute('select *from home.emp123')
for i in enumerate(row):
    print(i)

## Insert Multiple Records to DB

In [ ]:
from cassandra.query import BatchStatement

qr1= "insert into home.emp123(emp_id,emp_city,emp_name,emp_phone,emp_sal) values(%s,%s,%s,%s,%s)"
batch = BatchStatement()
batch.add(qr1,[6,'Thane','Vishnu',984539,200000])
batch.add(qr1,[7,'Benguluru','Krish',984540,280000])
batch.add(qr1,[8,'Benguluru','Rahul',984541,50000])
session.execute(batch)
print('Insert completed')

In [ ]:
row = session.execute('select *from home.emp123')
for i in row:
    print(i[0],'|',i[1],'|',i[2],'|',i[3],'|',i[4])

## Delete a record from EMP

In [ ]:
dt_rec= "delete from home.emp123 where emp_id= ?;"
dt_st= session.prepare(dt_rec)
session.execute(dt_st,[8])
print('Record deleted successfully...')

## Insert data from a CSV file to Cassandra DB

In [ ]:
import csv
with open('mydata.csv','r') as data:
    next(data)
    data_csv= csv.reader(data,delimiter=',')
    #csv reader object
    print(data_csv)
    all_value= []
    session.execute("Create table home.emp122(emp_id int PRIMARY KEY,First_name text,Date text);")
    for i in data_csv:
        print(i)
        session.execute("insert into home.emp122(emp_id,First_name,Date) values(%s,%s,%s)",[int(i[1]),i[2],i[3]])
print('Finished')

In [ ]:
row = session.execute('Select *from home.emp122')
for i in row:
    print(i)

In [ ]:
session.execute('Drop table home.emp122')